print(10/3) #나누기
print(10//3) #몫
print(10%3) #나머지

print(10**2)
print(2*10**3) #*보다 **가 먼저인식

#산술연산자* / // % + - 산술연산시 동급인 경우 왼쪽에서 오른쪽으로 먼저 계산
# cf. a=b=c=10 이는 오른쪽에서 왼쪽으로 입력됨 이전에 배움

print(10*2)
print(10/2)
print(10//2)
print(10%2)
print(10+2)
print(10-2)

print(1+2-3*4//5/6%7) #* // / % 동급  >   + - 동급


#관계연산자

a=10
b=5
print(a>b)
print(a<=b) #>= <= 처럼 =이 부등호 오른쪽에 위치해야됨 => =<하면 오류남

c=7
d=7
print(c<=d)

x=5
print(1<x<10)
print(1<x)

y=0.5
print(1>y>=-10)
print(0.1<y<0.7)

#원래는 1<x<10과 같은 범위를 설정하는것이 안되는데 파이썬은 가능하다
#원래는 1<x와 같은 관계만 가능함


#동등비교
print(10==10)
print(10!=10)

print("a"<"b") #문자들은 코드 숫자로 기억되기 때문에





